pitzDaily/0/tau
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volSymmTensorField;
    location    "0";
    object      tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
12225
(
(-0.0842369 0 0 0.0421185 0 0.0421185)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
30
(
(-0.168474 0 0 0.0842369 0 0.0842369)
(-0.168474 0 0 0.0842369 0 0.0842369)
(-0.168474 0 0 0.0842369 0 0.0842369)
(-0.168474 0 0 0.0842369 0 0.0842369)
(-0.168474 0 0 0.0842369 0 0.0842369)
(-0.168474 0 0 0.0842369 0 0.0842369)
(-0.168474 0 0 0.0842369 0 0.0842369)
(-0.168474 0 0 0.0842369 0 0.0842369)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0);
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
223
(
(-0.0842369 0 0 0.0421185 0 0.0421185)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
250
(
(-0.0842369 0 0 0.0421185 0 0.0421185)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(0 0 0 0 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
